{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10157219129645165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10157219129645165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10157219129645165:0", "name": "Share"}], "updated_time": "2016-10-24T14:33:12+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/13631429_10157219129645165_837014296460496381_n.jpg?oh=12c12aeda14159b4a0ea82dc377018d0&oe=5A08D7B2", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10157219129645165/?type=3", "created_time": "2016-07-06T09:55:42+0000", "message": "I will begin my Kenya visit on the evening of 10th July. India-Kenya ties have stood the test of time. Both our nations have had very strong people-to-people ties and both nations have successfully fought colonialism in the previous century. \n\nMy deliberations with President Uhuru Kenyatta will revolve around how India and Kenya can grow their bilateral cooperation. I envision better trade, commercial and cultural exchanges between India and Kenya. The potential is immense and together we seek to harness it. \n\nIn Nairobi, I will offer floral tributes to Mahatma Gandhi, who is widely revered in Kenya. I shall also pay tributes to Mzee Jomo Kenyatta, the first president of Kenya and a towering political figure of Africa. \n\nThe meeting of the India-Kenya business forum will be an important forum to elaborate more on the economic aspect of our relationship with Kenya. \n\nA programme that I am keenly looking forward to join is an interaction with students at the Nairobi University. \n\nIn order to deepen ties with the diaspora, I will address a community programme on 10th July. There is also a meeting with Bharatwallah Alumni Association during the visit. Another programme is the handing over of ambulances and a model of Bhabhatron.", "type": "photo", "id": "177526890164_10157219129645165", "status_type": "added_photos"}