{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10158737934285165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10158737934285165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10158737934285165:0", "name": "Share"}], "updated_time": "2017-05-11T01:33:18+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/18341823_10158737934285165_4413488803532547202_n.jpg?oh=b516ffccf5aeb98a1ebe4e2d209182ce&oe=5A0646B2", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10158737934285165/?type=3", "created_time": "2017-05-11T01:33:18+0000", "message": "I will be in Sri Lanka for a two-day visit starting today, 11th May. This will be my second bilateral visit there in two years, a sign of our strong relationship. \n\nDuring my visit, I will join the International Vesak Day celebrations in Colombo on 12th May, where I will interact with leading Buddhist spiritual leaders, scholars and theologians. It is my honour to join these celebrations with President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe. \n\nMy visit brings to the fore one of the most abiding links between India and Sri Lanka- the shared heritage of Buddhism. \n\nDuring my last visit in 2015, I had the opportunity to visit Anuradhapura, a UNESCO world heritage site and a leading centre of Buddhism for centuries. This time, I will be privileged to pay respect at the revered Sri Dalada Maligawa in Kandy, also known as the Temple of the Sacred Tooth Relic.\n \nMy visit will commence in Colombo with a visit to the Seema Malaka at the Gangaramayya temple where I will take part in the traditional lamp lighting ceremony. \n \nI will be meeting with President Sirisena, Prime Minister Wickremesinghe and other eminent dignitaries.\n \nI will also visit the up country region of Sri Lanka where I will inaugurate the Dickoya Hospital that has been built with Indian assistance, and have an interaction with the Indian-origin Tamil community.\n \nI will be sharing more from Sri Lanka on social media. You can watch all my programmes in Sri Lanka live on the ‘Narendra Modi Mobile App.’", "type": "photo", "id": "177526890164_10158737934285165", "status_type": "added_photos"}