{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10158827879780165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10158827879780165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10158827879780165:0", "name": "Share"}], "updated_time": "2017-07-02T14:51:31+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/18766002_10158827879780165_2730523575539596988_n.jpg?oh=cd13ccd44ec4a6b37cbc14b0b93f30c3&oe=59C8D945", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10158827879780165/?type=3", "created_time": "2017-05-28T09:46:32+0000", "message": "I will be visiting St. Petersburg, Russia from 31st May to 2nd June for the 18th India-Russia Annual Summit.\n\nOn 1st June, I will be conducting detailed discussions with President Putin to take forward our dialogue from the last Summit in Goa in October 2016. With a spotlight on economic ties, both President Putin and I will also be interacting with CEOs from both countries.\n\nOn the next day, I will be addressing the St. Petersburg International Economic Forum (SPIEF) together with President Putin.  I  appreciate the invitation to be the Guest of Honour at this year’s Forum. India is the Guest Country at the SPIEF this year.\n\nIn a first meeting of its kind, I will also have the opportunity to engage with Governors from various Russian regions to further broad base bilateral cooperation and more actively involve States/Regions and other diversified stakeholders. \n\nAt the beginning of my visit, I will go to Piskarovskoye Cemetery to pay homage to those who perished during the siege of Leningrad. I will also have occasion to visit the world famous State Hermitage Museum and the Institute of Oriental manuscripts. \n\nI greatly look forward to my visit to St. Petersburg in this special year for the bilateral relationship as both countries celebrate the 70th Anniversary of our diplomatic relations.", "type": "photo", "id": "177526890164_10158827879780165", "status_type": "added_photos"}