{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10158827870625165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10158827870625165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10158827870625165:0", "name": "Share"}], "updated_time": "2017-06-30T14:54:38+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/18671236_10158827870625165_5578267801804687394_n.jpg?oh=366286be656164477d718bc59e7379e2&oe=5A03039E", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10158827870625165/?type=3", "created_time": "2017-05-28T09:41:44+0000", "message": "I will visit Germany on 29-30 May 2017 on the invitation of German Chancellor Angela Merkel for the Fourth India-Germany Intergovernmental Consultations (IGC).\n\nIndia and Germany are large democracies, major economies and important players in regional and global affairs. Our strategic partnership is based on democratic values and commitment to an open, inclusive and rules-based global order. Germany is a valuable partner in our development initiatives and German competencies fit well with my vision for India’s transformation.\n\nI would begin my visit from Meseberg near Berlin in Germany, where Chancellor Merkel has very graciously invited me to hold discussions on issues of regional and global importance. \nOn 30 May, Chancellor Merkel and I will hold the 4th IGC to review the state of our bilateral relationship. We will also chart out a future roadmap of cooperation with focus on trade and investment, security and counter-terrorism, innovation and science & technology, skill development, urban infrastructure, railways and civil aviation, clean energy, development cooperation, health and alternative medicine.\n\nI would also call on H.E. Dr. Frank-Walter Steinmeier, President of the Federal Republic of Germany. \n\nGermany is our leading partner in trade, technology and investment. In Berlin, Chancellor Merkel and I will interact with top business leaders of both the countries to further strengthen our trade and investment ties.  \n\nI am confident that this visit will open a new chapter in our bilateral cooperation with Germany and further deepen our Strategic Partnership.", "type": "photo", "id": "177526890164_10158827870625165", "status_type": "added_photos"}