{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10159023954430165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10159023954430165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10159023954430165:0", "name": "Share"}], "updated_time": "2017-07-04T11:04:55+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/19601095_10159023954430165_6774112134922525943_n.jpg?oh=d42bd20d92f2a186f46d0638e82fd2be&oe=59DAE540", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10159023954430165/?type=3", "created_time": "2017-07-03T10:20:28+0000", "message": "I will be visiting Israel on 4-6 July, 2017 upon invitation of Prime Minister Benjamin Netanyahu - בנימין נתניהו. \n\nAs the first Indian Prime Minister to do so, I am greatly looking forward to this unprecedented visit that will bring our two countries and people closer. This year, India and Israel are marking 25 years of our diplomatic relations. \n\nI will have in-depth talks with Prime Minister Netanyahu on the full spectrum of our partnership and strengthening it in diverse fields for mutual benefit. We will also have the chance to discuss major common challenges like terrorism. \n\nI will meet President Reuven Ruvi Rivlin - ראובן רובי ריבלין who I had the pleasure of receiving in New Delhi in November last year, as well as other senior leaders.  \n\nMy programme during the visit gives me an opportunity to engage with a cross-section of Israeli society. I am particularly looking forward to interacting with the large vibrant Indian diaspora in Israel that represents an enduring link between our two peoples. \n\nOn the economic side, I will join with leading Indian and Israeli CEOs and start-ups to discuss our shared priority of expanding business and investment collaboration on the ground. In addition, I hope to get insights into Israel’s accomplishments in technology and innovation through on-site visits.\n\nDuring my stay, I will visit the Yad Vashem Memorial Museum to honour the memory of the victims of the holocaust that counts among the greatest tragedies in human history. Later, I will also pay my respects to the courageous Indian soldiers who laid down their lives during the liberation of Haifa in 1918.", "type": "photo", "id": "177526890164_10159023954430165", "status_type": "added_photos"}