{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10158963152670165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10158963152670165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10158963152670165:0", "name": "Share"}], "updated_time": "2017-07-01T10:50:41+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/19437245_10158963152670165_3661534254947287152_n.jpg?oh=14b2807e5a158af6e362955b84112556&oe=5A0BDD24", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10158963152670165/?type=3", "created_time": "2017-06-23T13:34:22+0000", "message": "I will be visiting the Netherlands on 27 June 2017. We are celebrating 70 years of the establishment of Indo-Dutch diplomatic relations this year. During the visit, I will have an official meeting with the Dutch Prime Minister H.E. Mr. Mark Rutte. I will also call on King Willem-Alexander of the Netherlands and meet Queen Maxima.\n\nI look forward to meeting Prime Minister Rutte and reviewing our bilateral relations. I would be exchanging views with PM Rutte on important global issues including counter-terrorism and climate change. \n\nEconomic relations form the core of our bilateral relations. The Netherlands is our 6th largest trading partner in the EU and 5th largest investment partner globally. The Dutch expertise in areas such as water and waste management, agriculture and food processing, renewable energy and ports and shipping, matches with our development needs. Indo-Dutch economic engagement is a win-win proposition. I will discuss with PM Rutte as to how the two sides should work to further harness the synergies. I will also be meeting with CEOs of major Dutch companies and will encourage them to join the Indian growth story.\n\nThere are strong people to people relations between the two countries with the presence of second largest Indian Diaspora in Europe in the Netherlands. I look forward to engaging with the Indian community in the Netherlands.", "type": "photo", "id": "177526890164_10158963152670165", "status_type": "added_photos"}