{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10157482794080165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10157482794080165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10157482794080165:0", "name": "Share"}], "updated_time": "2017-01-06T09:18:02+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t31.0-8/s720x720/14232002_10157482794080165_5955052869760845471_o.jpg?oh=b7aace5975747b246d9363391d394f26&oe=5A106BFD", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10157482794080165/?type=3", "created_time": "2016-09-02T02:41:44+0000", "message": "Greetings to the people of Vietnam on their National Day. Vietnam is a friendly nation with whom we cherish our relationship. \n\nToday evening, I will reach Hanoi in Vietnam, marking the start of a very important visit that will further cement the close bond between India and Vietnam. My Government attaches a high priority to our bilateral relations with Vietnam. The India-Vietnam partnership will benefit Asia and the rest of the world. \n\nDuring the visit, I will hold extensive discussions with Prime Minister Mr. Nguyen Xuan Phuc. We will review complete spectrum of our bilateral relationship. \n\nI will also meet the President of Vietnam, Mr. Tran Dai Quang, the General Secretary of the Communist Party of Vietnam, Mr. Nguyen Phu Trong; and the Chairperson of the National Assembly of Vietnam, Ms. Nguyen Thi Kim Ngan. \n\nWe wish to forge a strong economic relationship with Vietnam that can mutually benefit our citizens. Strengthening the people-to-people ties will also be an my endeavour during the Vietnam visit. \n\nIn Vietnam, I will have the opportunity to pay homage to Ho Chi Minh, one of 20th century’s tallest leaders. I will lay a wreath at the Monument of National Heroes and Martyrs as well as visit the Quan Su Pagoda.", "type": "photo", "id": "177526890164_10157482794080165", "status_type": "added_photos"}