{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10157816435845165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10157816435845165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10157816435845165:0", "name": "Share"}], "updated_time": "2017-06-14T15:06:33+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p480x480/14955929_10157816435845165_5033127385570191955_n.jpg?oh=dd7287fdc4d02632e937fe91ab0afb9f&oe=5A0D7D74", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10157816435845165/?type=3", "created_time": "2016-11-09T12:41:21+0000", "message": "I will visit Japan on 10-12 November 2016 for the Annual Summit. This will be my second visit to Japan as Prime Minister.\n\nOur partnership with Japan is characterized as a Special Strategic and Global Partnership. India and Japan see each other through a prism of shared Buddhist heritage, democratic values, and commitment to an open, inclusive and rules-based global order.\n\nToday, Japan is one of the top investors in India. But many Japanese companies, which are household names in India, have been committed to the potential of Indian economy for several decades. In Tokyo, I will have a detailed interaction with top business leaders from India and Japan, to look for ways to further strengthen our trade and investment ties.\n\nDuring the visit, I will have also the opportunity to pay a call on His Majesty the Emperor. And, I am looking forward to reviewing the entire spectrum of our bilateral cooperation when I meet Prime Minister Shinzo Abe in Tokyo on 11 November.\n\nOn 12 November, Prime Minister Abe and I will travel to Kobe on the famed Shinkansen – the technology that will be deployed for the Mumbai-Ahmedabad High Speed Railway. Both of us will also visit the Kawasaki Heavy Industries facility in Kobe, where high speed railway is manufactured.\n\nThe High Speed Railway cooperation between India and Japan is a shining example of the strength of our cooperation. It will not only boost our trade and investment ties, but will also create skilled jobs in India, improve our infrastructure and give a boost to our 'Make in India' mission.", "type": "photo", "id": "177526890164_10157816435845165", "status_type": "added_photos"}