{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10157683130305165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10157683130305165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10157683130305165:0", "name": "Share"}], "updated_time": "2016-12-19T05:21:39+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/14732250_10157683130305165_7473251719924319926_n.png?oh=f1c9b4c42b91ef138dc46a56a8bb6a18&oe=59CCB56D", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10157683130305165/?type=3", "created_time": "2016-10-14T03:18:26+0000", "message": "India is delighted to host the 8th BRICS Summit in Goa on 15-16 October 2016, followed by a first-ever BRICS-BIMSTEC Outreach Summit. I look forward to extending a warm welcome to the ten leaders of the BRICS and BIMSTEC families.\n \nIn Goa, I will also have the honour to receive President Vladimir Putin of Russia for the India-Russia Annual Summit and President Michel Temer of Brazil for a bilateral visit.\n \nPresident Putin’s visit will give us an opportunity to consolidate and reaffirm a unique time-tested friendship and partnership with Russia.\n \nPresident Temer’s visit will open up new areas for cooperation with Brazil, an important strategic partner.\n\nI also look forward to useful conversations with my fellow leaders from China, South Africa, Brazil and Russia on addressing pressing international and regional challenges that stand in the way of our goals.\n\nAs Chair of the BRICS this year, India has embraced a stronger emphasis on promoting people-to-people linkages in diverse fields including trade, sports, education, films, scholarship, and tourism.\n \nIt is anchored in the belief that our people are pivotal partners in our effort to craft responsive, collective and inclusive solutions.\n \nWe will launch new initiatives in Goa even as we mark the successful operationalization of initiatives like the BRICS New Development Bank and the Contingent Reserve Arrangement.\n \nI am optimistic that the BRICS Summit will strengthen intra-BRICS cooperation and advance our common agenda for development, peace, stability and reform. \n \nIn a first, I am happy that India is facilitating an outreach Summit with the BIMSTEC leaders of Bangladesh, Bhutan, Myanmar, Nepal, Sri Lanka and Thailand.\n \nRepresenting nearly two thirds of humanity together, we hope to tap the potential for cooperation and the dividends this will bring. India looks forward to building bridges to new partnerships and finding common resolve and solutions to our entrenched problems.", "type": "photo", "id": "177526890164_10157683130305165", "status_type": "added_photos"}