{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10156832459045165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10156832459045165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10156832459045165:0", "name": "Share"}], "updated_time": "2016-03-29T05:49:56+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/p720x720/12592629_10156832459045165_850080022934185925_n.png?oh=290c175cb364c35c1f86844e2fc4fee1&oe=59D4EA18", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10156832459045165/?type=3", "created_time": "2016-03-29T05:49:56+0000", "message": "On 30th March, I will be in Brussels to meet with the Belgian Prime Minister Mr. Charles Michel. I would also be holding the 13th India-EU Summit with the E.U. leadership. \n\nNo words are enough to salute the resilience and spirit of the people of Belgium. We stand shoulder to shoulder with them in the wake of the horrific attacks in Brussels and share the grief of those who lost their loved ones. \n\nOur relations with Belgium are deep rooted and have stood the test of time. Within the E.U., Belgium is India’s 2nd largest trading partner. My meeting with the Prime Minister aims to expand trade, investment and high technology partnership with this important E.U. member. \n\nAlong with Prime Minister Charles Michel, I would remote activate the India-Belgium ARIES (Aryabhatta Research Institute for Observational Sciences) Telescope.\n\nThe European Union is a vital trading partner and the biggest export destination for India. This Summit will advance our multifaceted engagement across a whole range of domains. \n\nIn Brussels, I would also be meeting with the Members of European Parliament (MEPs), Indologists, Belgian CEOs as well as a wide cross section of the Indian diaspora in Belgium. I would also interact with the Board Members of the Association of Diamond Traders in Belgium. \n\nThe same evening, I will address a Community Programme and interact with the Indian community.", "type": "photo", "id": "177526890164_10156832459045165", "status_type": "added_photos"}