{"from": {"name": "Narendra Modi", "id": "177526890164"}, "actions": [{"link": "https://www.facebook.com/narendramodi/posts/10157219106520165:0", "name": "Like"}, {"link": "https://www.facebook.com/narendramodi/posts/10157219106520165:0", "name": "Comment"}, {"link": "https://www.facebook.com/narendramodi/posts/10157219106520165:0", "name": "Share"}], "updated_time": "2016-10-24T14:33:44+0000", "full_picture": "https://scontent.xx.fbcdn.net/v/t1.0-9/p720x720/13592434_10157219106520165_8595784342907683819_n.jpg?oh=574a513acd7c231cdcae7895d1864058&oe=5A11A4A4", "link": "https://www.facebook.com/narendramodi/photos/a.10150164299700165.421791.177526890164/10157219106520165/?type=3", "created_time": "2016-07-06T09:39:03+0000", "message": "On the evening of 7th July, I will reach Pretoria in South Africa. South Africa is an important strategic partner, with whom our ties are historical and deep-rooted. My programmes in South Africa will span across Pretoria, Johannesburg, Durban and Pietermaritzburg. \n\nHistory is witness to how Mahatma Gandhi’s stay in South Africa impacted him and the history of the world. He went to South Africa as a lawyer seeking work and returned to India as a strong voice for humanitarian values, who would go on to shape the history of humankind. \n\nI will have the honour to visit Phoenix Settlement and Pietermaritzburg Station, two places very closely associated with Mahatma Gandhi’s stay in South Africa. A visit to South Africa is incomplete without remembering the beloved Madiba.  I will also be honoured to visit the Constitutional Hill and Nelson Mandela Foundation where I would pay my tributes to an icon of human history, who made his country and the world a much better place.\n\nDuring my visit, I will meet President Zuma. I will also be meeting Mr. Cyril Ramaphosa, the Deputy President. \n\nIn an effort to boost our economic ties, I will speak at the India-South Africa business meet. Other programmes include a meeting with the Alumni Network in Durban and a reception hosted by the Mayor of Durban, at Durban City Hall.\n\nSouth Africa is home to a vibrant Indian community, that has made South Africa their home for years. I will interact with the Indian community a programme in Johannesburg on 8th July. I invite you to share your ideas and inputs for my speech, through the ‘Narendra Modi Mobile App.’ http://nm4.in/dnldapp", "type": "photo", "id": "177526890164_10157219106520165", "status_type": "added_photos"}